app/Http/Controllers/AuthController.php

insert into `users` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('test', 'test@gmail.com', '$2y$12$byj0wFNPIT4R/TSpczvLDu0hh17STcI4GmjrCM33qqkBEguBcz1na', '2025-07-30 03:17:05', '2025-07-30 03:17:05')
---
    public function registerStore(Request $request)
    {
        $validated = $request->validate([
            'name' => ['required', 'string', 'min:3', 'max:30'],
            'email' => ['required', 'unique:users,email'],
            'password' => ['required', 'string', 'min:8', 'max:30', 'confirmed'],
        ]);

        $user = User::create($validated);