app/Http/Controllers/DonorController.php

    public function index()
    {
        return view('home-page', [
            'donor' => auth()->user()->donor,
            'blogs' => Blog::latest()->get()
        ]);
---
select * from `donors` where `donors`.`user_id` = 34 and `donors`.`user_id` is not null limit 1