app/Http/Controllers/Admin/DashboardController.php

select count(*) as aggregate from `donors` where `status` = 'approved'
select count(*) as aggregate from `donors` where `status` = 'pending'
select count(*) as aggregate from `donors` where `last_donation_at` is not null and `cooldown_until` > '2025-07-30 17:56:44'
select sum(`donation_count`) as aggregate from `donors`
---
    public function index()
    {
        $numOfDonors = Donor::where('status', '=', 'approved')->count();
        $numOfPending = Donor::where('status', '=', 'pending')->count();
        $numOfAvailable = Donor::whereNotNull('last_donation_at')
            ->where('cooldown_until', '>', now())
            ->count();

        $totalDonations = Donor::sum('donation_count');