app/Http/Controllers/Admin/DonorController.php

select * from `blood_banks` where `blood_banks`.`id` in (1)
select * from `donors` order by `created_at` desc limit 10 offset 0
select * from `users` where `users`.`id` in (23, 25, 26, 27, 28, 29, 30, 31, 32, 33)
select count(*) as aggregate from `donors`
---
    public function index(Request $request)
    {
        $donors = Donor::with('user', 'bloodBank')->filter($request->only(['search', 'status']))->latest()->paginate(10);